Revit 2027 API
BuiltInFailures.SketchFailures.UnsatisfiedSupportAssocProp Property
 Constraint between a Line created with Pick Support and the Support is not satisfied.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId UnsatisfiedSupportAssocProp { get; }
Public Shared ReadOnly Property UnsatisfiedSupportAssocProp As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ UnsatisfiedSupportAssocProp {
	FailureDefinitionId^ get ();
}
static member UnsatisfiedSupportAssocProp : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace